#ddr pin xdc
create_clock -period 5.000 -name sysclk_i -add [get_ports sysclk_p]
set_property PACKAGE_PIN AH6 [get_ports sysclk_p]
set_property PACKAGE_PIN AH5 [get_ports sysclk_n]
set_property IOSTANDARD DIFF_SSTL15 [get_ports sysclk_p]
set_property PACKAGE_PIN G25 [get_ports pcie_rst_n]
set_property IOSTANDARD LVCMOS18 [get_ports pcie_rst_n]


# PCI Express reference clock 100MHz
create_clock -period 10.000 -name pcie_sys_clk -waveform {0.000 5.000} [get_ports {pcie_ref_clk_p[0]}]
set_property PACKAGE_PIN N8 [get_ports {pcie_ref_clk_p[0]}]
# MGT locations

create_clock -period 5.000 -name chip_outclk0 [get_ports {west0_pin_out[0]}]
create_clock -period 5.000 -name chip_outclk1 [get_ports {west1_pin_out[0]}]
create_clock -period 5.000 -name chip_outclk2 [get_ports {west2_pin_out[0]}]
create_clock -period 5.000 -name chip_outclk3 [get_ports {west3_pin_out[0]}]
create_clock -period 5.000 -name chip_outclk4 [get_ports {west4_pin_out[0]}]
create_clock -period 5.000 -name chip_outclk5 [get_ports {west5_pin_out[0]}]


#set_property LOC GTXE2_CHANNEL_X0Y7 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[0].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property LOC GTXE2_CHANNEL_X0Y7 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[0].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property PACKAGE_PIN M6 [get_ports {pcie_mgt_rxp[0]}]
set_property PACKAGE_PIN L4 [get_ports {pcie_mgt_txp[0]}]
#set_property LOC GTXE2_CHANNEL_X0Y6 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[1].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property LOC GTXE2_CHANNEL_X0Y6 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[1].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property PACKAGE_PIN P6 [get_ports {pcie_mgt_rxp[1]}]
set_property PACKAGE_PIN M2 [get_ports {pcie_mgt_txp[1]}]
#set_property LOC GTXE2_CHANNEL_X0Y5 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[2].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property LOC GTXE2_CHANNEL_X0Y5 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[2].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property PACKAGE_PIN R4 [get_ports {pcie_mgt_rxp[2]}]
set_property PACKAGE_PIN N4 [get_ports {pcie_mgt_txp[2]}]
#set_property LOC GTXE2_CHANNEL_X0Y4 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[3].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property LOC GTXE2_CHANNEL_X0Y4 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[3].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property PACKAGE_PIN T6 [get_ports {pcie_mgt_rxp[3]}]
set_property PACKAGE_PIN P2 [get_ports {pcie_mgt_txp[3]}]
#set_property LOC GTXE2_CHANNEL_X0Y3 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[4].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property LOC GTXE2_CHANNEL_X0Y3 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[4].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property PACKAGE_PIN V6 [get_ports {pcie_mgt_rxp[4]}]
set_property PACKAGE_PIN T2 [get_ports {pcie_mgt_txp[4]}]
#set_property LOC GTXE2_CHANNEL_X0Y2 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[5].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property LOC GTXE2_CHANNEL_X0Y2 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[5].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property PACKAGE_PIN W4 [get_ports {pcie_mgt_rxp[5]}]
set_property PACKAGE_PIN U4 [get_ports {pcie_mgt_txp[5]}]
#set_property LOC GTXE2_CHANNEL_X0Y1 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[6].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property LOC GTXE2_CHANNEL_X0Y1 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[6].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property PACKAGE_PIN Y6 [get_ports {pcie_mgt_rxp[6]}]
set_property PACKAGE_PIN V2 [get_ports {pcie_mgt_txp[6]}]
#set_property LOC GTXE2_CHANNEL_X0Y0 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[7].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property LOC GTXE2_CHANNEL_X0Y0 [get_cells {pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/gt_top_i/pipe_wrapper_i/pipe_lane[7].gt_wrapper_i/gtx_channel.gtxe2_channel_i}]
set_property PACKAGE_PIN AA4 [get_ports {pcie_mgt_rxp[7]}]
set_property PACKAGE_PIN Y2 [get_ports {pcie_mgt_txp[7]}]


#power con
set_property PACKAGE_PIN AB18 [get_ports {power_con[0]}]
set_property PACKAGE_PIN AB19 [get_ports {power_con[1]}]
set_property PACKAGE_PIN AC19 [get_ports {power_con[2]}]
set_property PACKAGE_PIN AB17 [get_ports {power_con[3]}]
set_property PACKAGE_PIN AC17 [get_ports {power_con[4]}]
set_property PACKAGE_PIN AE15 [get_ports {power_con[5]}]
set_property PACKAGE_PIN AE14 [get_ports {power_con[6]}]
set_property PACKAGE_PIN AA15 [get_ports {power_con[7]}]
set_property PACKAGE_PIN AB15 [get_ports {power_con[8]}]
set_property PACKAGE_PIN AC16 [get_ports {power_con[9]}]
set_property PACKAGE_PIN AC15 [get_ports {power_con[10]}]
set_property PACKAGE_PIN AC14 [get_ports {power_con[11]}]
set_property PACKAGE_PIN AD14 [get_ports {power_con[12]}]
set_property PACKAGE_PIN AA17 [get_ports {power_con[13]}]
set_property PACKAGE_PIN AA16 [get_ports {power_con[14]}]
set_property PACKAGE_PIN Y16 [get_ports {power_con[15]}]
#set_property PACKAGE_PIN W19  [get_ports LED]
#set_property PACKAGE_PIN F21  [get_ports d2_clk]

set_property IOSTANDARD LVCMOS18 [get_ports {power_con[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {power_con[15]}]
#set_property IOSTANDARD LVCMOS18 [get_ports LED]
#set_property IOSTANDARD LVCMOS18 [get_ports d2_clk]

#chip
set_property PACKAGE_PIN Y26 [get_ports {north0_pin_in[0]}]
set_property PACKAGE_PIN W28 [get_ports {north0_pin_in[1]}]
set_property PACKAGE_PIN AA25 [get_ports {north0_pin_in[2]}]
set_property PACKAGE_PIN Y29 [get_ports {north0_pin_in[3]}]
set_property PACKAGE_PIN W27 [get_ports {north0_pin_in[4]}]
set_property PACKAGE_PIN AB29 [get_ports {north0_pin_in[5]}]
set_property PACKAGE_PIN Y30 [get_ports {north0_pin_in[6]}]
set_property PACKAGE_PIN Y28 [get_ports {north0_pin_in[7]}]
set_property PACKAGE_PIN AA28 [get_ports {north0_pin_in[8]}]
set_property PACKAGE_PIN W29 [get_ports {north0_pin_in[9]}]
set_property PACKAGE_PIN AB30 [get_ports {north0_pin_in[10]}]
set_property PACKAGE_PIN AA30 [get_ports {north0_pin_in[11]}]
set_property PACKAGE_PIN AA26 [get_ports {north0_pin_in[12]}]
set_property PACKAGE_PIN AC30 [get_ports {north0_pin_in[13]}]
set_property PACKAGE_PIN AB28 [get_ports {north0_pin_in[14]}]
set_property PACKAGE_PIN AB27 [get_ports {north0_pin_in[15]}]
set_property PACKAGE_PIN AB25 [get_ports {north0_pin_in[16]}]
set_property PACKAGE_PIN AA27 [get_ports {north0_pin_in[17]}]
set_property PACKAGE_PIN AD28 [get_ports {north0_pin_out[0]}]
set_property PACKAGE_PIN AD26 [get_ports {north0_pin_out[1]}]
set_property PACKAGE_PIN AD27 [get_ports {north0_pin_out[2]}]
set_property PACKAGE_PIN AC29 [get_ports {north0_pin_out[3]}]
set_property PACKAGE_PIN AD29 [get_ports {north0_pin_out[4]}]
set_property PACKAGE_PIN AE28 [get_ports {north0_pin_out[5]}]
set_property PACKAGE_PIN AC26 [get_ports {north0_pin_out[6]}]
set_property PACKAGE_PIN AC27 [get_ports {north0_pin_out[7]}]
set_property PACKAGE_PIN AF26 [get_ports {north0_pin_out[8]}]
set_property PACKAGE_PIN AG27 [get_ports {north0_pin_out[9]}]
set_property PACKAGE_PIN AE29 [get_ports {north0_pin_out[10]}]
set_property PACKAGE_PIN AE30 [get_ports {north0_pin_out[11]}]
set_property PACKAGE_PIN AG30 [get_ports {north0_pin_out[12]}]
set_property PACKAGE_PIN AF30 [get_ports {north0_pin_out[13]}]
set_property PACKAGE_PIN AF28 [get_ports {north0_pin_out[14]}]
set_property PACKAGE_PIN AF27 [get_ports {north0_pin_out[15]}]
set_property PACKAGE_PIN AG28 [get_ports {north0_pin_out[16]}]
set_property PACKAGE_PIN AG29 [get_ports {north0_pin_out[17]}]
set_property PACKAGE_PIN AJ27 [get_ports {north1_pin_in[0]}]
set_property PACKAGE_PIN AJ28 [get_ports {north1_pin_in[1]}]
set_property PACKAGE_PIN AK26 [get_ports {north1_pin_in[2]}]
set_property PACKAGE_PIN AJ26 [get_ports {north1_pin_in[3]}]
set_property PACKAGE_PIN AH26 [get_ports {north1_pin_in[4]}]
set_property PACKAGE_PIN AH29 [get_ports {north1_pin_in[5]}]
set_property PACKAGE_PIN AK30 [get_ports {north1_pin_in[6]}]
set_property PACKAGE_PIN AK29 [get_ports {north1_pin_in[7]}]
set_property PACKAGE_PIN AH27 [get_ports {north1_pin_in[8]}]
set_property PACKAGE_PIN AK28 [get_ports {north1_pin_in[9]}]
set_property PACKAGE_PIN AH30 [get_ports {north1_pin_in[10]}]
set_property PACKAGE_PIN AJ29 [get_ports {north1_pin_in[11]}]
set_property PACKAGE_PIN Y21 [get_ports {north1_pin_in[12]}]
set_property PACKAGE_PIN AG24 [get_ports {north1_pin_in[13]}]
set_property PACKAGE_PIN AA21 [get_ports {north1_pin_in[14]}]
set_property PACKAGE_PIN AA22 [get_ports {north1_pin_in[15]}]
set_property PACKAGE_PIN AC24 [get_ports {north1_pin_in[16]}]
set_property PACKAGE_PIN AD24 [get_ports {north1_pin_in[17]}]
set_property PACKAGE_PIN Y24 [get_ports {north1_pin_out[0]}]
set_property PACKAGE_PIN AK25 [get_ports {north1_pin_out[1]}]
set_property PACKAGE_PIN AK24 [get_ports {north1_pin_out[2]}]
set_property PACKAGE_PIN AC25 [get_ports {north1_pin_out[3]}]
set_property PACKAGE_PIN Y23 [get_ports {north1_pin_out[4]}]
set_property PACKAGE_PIN AB24 [get_ports {north1_pin_out[5]}]
set_property PACKAGE_PIN AK21 [get_ports {north1_pin_out[6]}]
set_property PACKAGE_PIN AE25 [get_ports {north1_pin_out[7]}]
set_property PACKAGE_PIN AC22 [get_ports {north1_pin_out[8]}]
set_property PACKAGE_PIN AB22 [get_ports {north1_pin_out[9]}]
set_property PACKAGE_PIN AC21 [get_ports {north1_pin_out[10]}]
set_property PACKAGE_PIN AD21 [get_ports {north1_pin_out[11]}]
set_property PACKAGE_PIN AB23 [get_ports {north1_pin_out[12]}]
set_property PACKAGE_PIN AD23 [get_ports {north1_pin_out[13]}]
set_property PACKAGE_PIN AK20 [get_ports {north1_pin_out[14]}]
set_property PACKAGE_PIN AC20 [get_ports {north1_pin_out[15]}]
set_property PACKAGE_PIN AK23 [get_ports {north1_pin_out[16]}]
set_property PACKAGE_PIN AA23 [get_ports {north1_pin_out[17]}]
set_property PACKAGE_PIN AH20 [get_ports {north2_pin_in[0]}]
set_property PACKAGE_PIN AF22 [get_ports {north2_pin_in[1]}]
set_property PACKAGE_PIN AG23 [get_ports {north2_pin_in[2]}]
set_property PACKAGE_PIN AJ23 [get_ports {north2_pin_in[3]}]
set_property PACKAGE_PIN AG22 [get_ports {north2_pin_in[4]}]
set_property PACKAGE_PIN AH21 [get_ports {north2_pin_in[5]}]
set_property PACKAGE_PIN AG20 [get_ports {north2_pin_in[6]}]
set_property PACKAGE_PIN AF23 [get_ports {north2_pin_in[7]}]
set_property PACKAGE_PIN AF20 [get_ports {north2_pin_in[8]}]
set_property PACKAGE_PIN AH22 [get_ports {north2_pin_in[9]}]
set_property PACKAGE_PIN AF21 [get_ports {north2_pin_in[10]}]
set_property PACKAGE_PIN AE21 [get_ports {north2_pin_in[11]}]
set_property PACKAGE_PIN AB20 [get_ports {north2_pin_in[12]}]
set_property PACKAGE_PIN AA20 [get_ports {north2_pin_in[13]}]
set_property PACKAGE_PIN AJ21 [get_ports {north2_pin_in[14]}]
set_property PACKAGE_PIN AJ22 [get_ports {north2_pin_in[15]}]
set_property PACKAGE_PIN AE23 [get_ports {north2_pin_in[16]}]
set_property PACKAGE_PIN AD22 [get_ports {north2_pin_in[17]}]
set_property PACKAGE_PIN AG25 [get_ports {north2_pin_out[0]}]
set_property PACKAGE_PIN AJ24 [get_ports {north2_pin_out[1]}]
set_property PACKAGE_PIN AE24 [get_ports {north2_pin_out[2]}]
set_property PACKAGE_PIN AH25 [get_ports {north2_pin_out[3]}]
set_property PACKAGE_PIN AF25 [get_ports {north2_pin_out[4]}]
set_property PACKAGE_PIN AH24 [get_ports {north2_pin_out[5]}]
set_property PACKAGE_PIN V29 [get_ports {north2_pin_out[6]}]
set_property PACKAGE_PIN V30 [get_ports {north2_pin_out[7]}]
set_property PACKAGE_PIN W24 [get_ports {north2_pin_out[8]}]
set_property PACKAGE_PIN U22 [get_ports {north2_pin_out[9]}]
set_property PACKAGE_PIN U25 [get_ports {north2_pin_out[10]}]
set_property PACKAGE_PIN V27 [get_ports {north2_pin_out[11]}]
set_property PACKAGE_PIN U23 [get_ports {north2_pin_out[12]}]
set_property PACKAGE_PIN V25 [get_ports {north2_pin_out[13]}]
set_property PACKAGE_PIN U28 [get_ports {north2_pin_out[14]}]
set_property PACKAGE_PIN W26 [get_ports {north2_pin_out[15]}]
set_property PACKAGE_PIN V26 [get_ports {north2_pin_out[16]}]
set_property PACKAGE_PIN W23 [get_ports {north2_pin_out[17]}]

set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_in[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north0_pin_out[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_in[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north1_pin_out[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_in[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {north2_pin_out[17]}]


set_property PACKAGE_PIN AK19 [get_ports {die0_pin_test[0]}]
set_property PACKAGE_PIN AG19 [get_ports {die0_pin_test[1]}]
set_property PACKAGE_PIN AH19 [get_ports {die0_pin_test[2]}]
set_property PACKAGE_PIN AJ18 [get_ports {die0_pin_test[3]}]
set_property PACKAGE_PIN AK18 [get_ports {die0_pin_test[4]}]
set_property PACKAGE_PIN AD19 [get_ports {die0_pin_test[5]}]
set_property PACKAGE_PIN AE19 [get_ports {die0_pin_test[6]}]
set_property PACKAGE_PIN AF16 [get_ports die0_rst_n]
set_property PACKAGE_PIN AE16 [get_ports die0_refclk]
#set_property PACKAGE_PIN AH15 [get_ports {die0_pin_test[0]}]
#set_property PACKAGE_PIN AH16 [get_ports {die0_pin_test[1]}]
#set_property PACKAGE_PIN AJ16 [get_ports {die0_pin_test[2]}]
#set_property PACKAGE_PIN AF15 [get_ports {die0_pin_test[3]}]
#set_property PACKAGE_PIN AG14 [get_ports {die0_pin_test[4]}]
#set_property PACKAGE_PIN AH17 [get_ports {die0_pin_test[5]}]
#set_property PACKAGE_PIN AJ17 [get_ports {die0_pin_test[6]}]
#set_property PACKAGE_PIN AK15 [get_ports die0_rst_n]
#set_property PACKAGE_PIN AK16 [get_ports die0_refclk]
set_property PACKAGE_PIN AG17 [get_ports {die2_pin_test[0]}]
set_property PACKAGE_PIN AD18 [get_ports {die2_pin_test[1]}]
set_property PACKAGE_PIN AE18 [get_ports {die2_pin_test[2]}]
set_property PACKAGE_PIN AD17 [get_ports {die2_pin_test[3]}]
set_property PACKAGE_PIN AD16 [get_ports {die2_pin_test[4]}]
set_property PACKAGE_PIN Y19 [get_ports {die2_pin_test[5]}]
set_property PACKAGE_PIN Y18 [get_ports {die2_pin_test[6]}]
set_property PACKAGE_PIN AG18 [get_ports die2_rst_n]
set_property PACKAGE_PIN AF18 [get_ports die2_refclk]
set_property IOSTANDARD LVCMOS18 [get_ports {die0_pin_test[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {die0_pin_test[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {die0_pin_test[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {die0_pin_test[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {die0_pin_test[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {die0_pin_test[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {die0_pin_test[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports die0_rst_n]
set_property IOSTANDARD LVCMOS18 [get_ports die0_refclk]
set_property IOSTANDARD LVCMOS18 [get_ports {die2_pin_test[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {die2_pin_test[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {die2_pin_test[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {die2_pin_test[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {die2_pin_test[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {die2_pin_test[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {die2_pin_test[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports die2_rst_n]
set_property IOSTANDARD LVCMOS18 [get_ports die2_refclk]



#west
set_property PACKAGE_PIN K30 [get_ports {west0_pin_in[0]}]
set_property PACKAGE_PIN J28 [get_ports {west0_pin_in[1]}]
set_property PACKAGE_PIN K21 [get_ports {west0_pin_in[2]}]
set_property PACKAGE_PIN L21 [get_ports {west0_pin_in[3]}]
set_property PACKAGE_PIN M20 [get_ports {west0_pin_in[4]}]
set_property PACKAGE_PIN K24 [get_ports {west0_pin_in[5]}]
set_property PACKAGE_PIN L23 [get_ports {west0_pin_in[6]}]
set_property PACKAGE_PIN L22 [get_ports {west0_pin_in[7]}]
set_property PACKAGE_PIN L20 [get_ports {west0_pin_in[8]}]
set_property PACKAGE_PIN J27 [get_ports {west0_pin_in[9]}]
set_property PACKAGE_PIN J24 [get_ports {west0_pin_in[10]}]
set_property PACKAGE_PIN L30 [get_ports {west0_pin_in[11]}]
set_property PACKAGE_PIN K23 [get_ports {west0_pin_in[12]}]
set_property PACKAGE_PIN J29 [get_ports {west0_pin_in[13]}]
set_property PACKAGE_PIN J22 [get_ports {west0_pin_in[14]}]
set_property PACKAGE_PIN J21 [get_ports {west0_pin_in[15]}]
set_property PACKAGE_PIN J23 [get_ports {west0_pin_in[16]}]
set_property PACKAGE_PIN H29 [get_ports {west0_pin_in[17]}]
set_property PACKAGE_PIN N19 [get_ports {west0_pin_out[0]}]
set_property PACKAGE_PIN N20 [get_ports {west0_pin_out[1]}]
set_property PACKAGE_PIN P21 [get_ports {west0_pin_out[2]}]
set_property PACKAGE_PIN P22 [get_ports {west0_pin_out[3]}]
set_property PACKAGE_PIN P23 [get_ports {west0_pin_out[4]}]
set_property PACKAGE_PIN M24 [get_ports {west0_pin_out[5]}]
set_property PACKAGE_PIN N25 [get_ports {west0_pin_out[6]}]
set_property PACKAGE_PIN N22 [get_ports {west0_pin_out[7]}]
set_property PACKAGE_PIN N24 [get_ports {west0_pin_out[8]}]
set_property PACKAGE_PIN N26 [get_ports {west0_pin_out[9]}]
set_property PACKAGE_PIN N27 [get_ports {west0_pin_out[10]}]
set_property PACKAGE_PIN N30 [get_ports {west0_pin_out[11]}]
set_property PACKAGE_PIN M28 [get_ports {west0_pin_out[12]}]
set_property PACKAGE_PIN M27 [get_ports {west0_pin_out[13]}]
set_property PACKAGE_PIN N21 [get_ports {west0_pin_out[14]}]
set_property PACKAGE_PIN M25 [get_ports {west0_pin_out[15]}]
set_property PACKAGE_PIN L26 [get_ports {west0_pin_out[16]}]
set_property PACKAGE_PIN N29 [get_ports {west0_pin_out[17]}]
set_property PACKAGE_PIN M29 [get_ports {west1_pin_in[0]}]
set_property PACKAGE_PIN M30 [get_ports {west1_pin_in[1]}]
set_property PACKAGE_PIN L27 [get_ports {west1_pin_in[2]}]
set_property PACKAGE_PIN K29 [get_ports {west1_pin_in[3]}]
set_property PACKAGE_PIN L25 [get_ports {west1_pin_in[4]}]
set_property PACKAGE_PIN L28 [get_ports {west1_pin_in[5]}]
set_property PACKAGE_PIN K28 [get_ports {west1_pin_in[6]}]
set_property PACKAGE_PIN K25 [get_ports {west1_pin_in[7]}]
set_property PACKAGE_PIN K26 [get_ports {west1_pin_in[8]}]
set_property PACKAGE_PIN M22 [get_ports {west1_pin_in[9]}]
set_property PACKAGE_PIN M23 [get_ports {west1_pin_in[10]}]
set_property PACKAGE_PIN J26 [get_ports {west1_pin_in[11]}]
set_property PACKAGE_PIN H26 [get_ports {west1_pin_in[12]}]
set_property PACKAGE_PIN H27 [get_ports {west1_pin_in[13]}]
set_property PACKAGE_PIN G28 [get_ports {west1_pin_in[14]}]
set_property PACKAGE_PIN G27 [get_ports {west1_pin_in[15]}]
set_property PACKAGE_PIN H25 [get_ports {west1_pin_in[16]}]
set_property PACKAGE_PIN F28 [get_ports {west1_pin_in[17]}]
set_property PACKAGE_PIN E26 [get_ports {west1_pin_out[0]}]
set_property PACKAGE_PIN G24 [get_ports {west1_pin_out[1]}]
set_property PACKAGE_PIN G23 [get_ports {west1_pin_out[2]}]
set_property PACKAGE_PIN D24 [get_ports {west1_pin_out[3]}]
set_property PACKAGE_PIN E24 [get_ports {west1_pin_out[4]}]
set_property PACKAGE_PIN F26 [get_ports {west1_pin_out[5]}]
set_property PACKAGE_PIN C24 [get_ports {west1_pin_out[6]}]
set_property PACKAGE_PIN B28 [get_ports {west1_pin_out[7]}]
set_property PACKAGE_PIN D26 [get_ports {west1_pin_out[8]}]
set_property PACKAGE_PIN A28 [get_ports {west1_pin_out[9]}]
set_property PACKAGE_PIN B25 [get_ports {west1_pin_out[10]}]
set_property PACKAGE_PIN B24 [get_ports {west1_pin_out[11]}]
set_property PACKAGE_PIN B27 [get_ports {west1_pin_out[12]}]
set_property PACKAGE_PIN C26 [get_ports {west1_pin_out[13]}]
set_property PACKAGE_PIN A25 [get_ports {west1_pin_out[14]}]
set_property PACKAGE_PIN A26 [get_ports {west1_pin_out[15]}]
set_property PACKAGE_PIN A27 [get_ports {west1_pin_out[16]}]
set_property PACKAGE_PIN C25 [get_ports {west1_pin_out[17]}]
set_property PACKAGE_PIN C29 [get_ports {west2_pin_in[0]}]
set_property PACKAGE_PIN D28 [get_ports {west2_pin_in[1]}]
set_property PACKAGE_PIN C30 [get_ports {west2_pin_in[2]}]
set_property PACKAGE_PIN D29 [get_ports {west2_pin_in[3]}]
set_property PACKAGE_PIN F27 [get_ports {west2_pin_in[4]}]
set_property PACKAGE_PIN H24 [get_ports {west2_pin_in[5]}]
set_property PACKAGE_PIN F25 [get_ports {west2_pin_in[6]}]
set_property PACKAGE_PIN E28 [get_ports {west2_pin_in[7]}]
set_property PACKAGE_PIN D27 [get_ports {west2_pin_in[8]}]
set_property PACKAGE_PIN A30 [get_ports {west2_pin_in[9]}]
set_property PACKAGE_PIN B30 [get_ports {west2_pin_in[10]}]
set_property PACKAGE_PIN C27 [get_ports {west2_pin_in[11]}]
set_property PACKAGE_PIN E23 [get_ports {west2_pin_in[12]}]
set_property PACKAGE_PIN E25 [get_ports {west2_pin_in[13]}]
set_property PACKAGE_PIN D23 [get_ports {west2_pin_in[14]}]
set_property PACKAGE_PIN B29 [get_ports {west2_pin_in[15]}]
set_property PACKAGE_PIN A23 [get_ports {west2_pin_in[16]}]
set_property PACKAGE_PIN B23 [get_ports {west2_pin_in[17]}]
set_property PACKAGE_PIN F30 [get_ports {west2_pin_out[0]}]
set_property PACKAGE_PIN E30 [get_ports {west2_pin_out[1]}]
set_property PACKAGE_PIN G29 [get_ports {west2_pin_out[2]}]
set_property PACKAGE_PIN G30 [get_ports {west2_pin_out[3]}]
set_property PACKAGE_PIN H30 [get_ports {west2_pin_out[4]}]
set_property PACKAGE_PIN E29 [get_ports {west2_pin_out[5]}]
set_property PACKAGE_PIN R29 [get_ports {west2_pin_out[6]}]
set_property PACKAGE_PIN T23 [get_ports {west2_pin_out[7]}]
set_property PACKAGE_PIN T27 [get_ports {west2_pin_out[8]}]
set_property PACKAGE_PIN U30 [get_ports {west2_pin_out[9]}]
set_property PACKAGE_PIN U27 [get_ports {west2_pin_out[10]}]
set_property PACKAGE_PIN R30 [get_ports {west2_pin_out[11]}]
set_property PACKAGE_PIN T22 [get_ports {west2_pin_out[12]}]
set_property PACKAGE_PIN T25 [get_ports {west2_pin_out[13]}]
set_property PACKAGE_PIN U29 [get_ports {west2_pin_out[14]}]
set_property PACKAGE_PIN T30 [get_ports {west2_pin_out[15]}]
set_property PACKAGE_PIN T26 [get_ports {west2_pin_out[16]}]
set_property PACKAGE_PIN T28 [get_ports {west2_pin_out[17]}]
set_property PACKAGE_PIN J19 [get_ports {west3_pin_in[0]}]
set_property PACKAGE_PIN K18 [get_ports {west3_pin_in[1]}]
set_property PACKAGE_PIN K20 [get_ports {west3_pin_in[2]}]
set_property PACKAGE_PIN H21 [get_ports {west3_pin_in[3]}]
set_property PACKAGE_PIN H22 [get_ports {west3_pin_in[4]}]
set_property PACKAGE_PIN H20 [get_ports {west3_pin_in[5]}]
set_property PACKAGE_PIN C21 [get_ports {west3_pin_in[6]}]
set_property PACKAGE_PIN F22 [get_ports {west3_pin_in[7]}]
set_property PACKAGE_PIN G22 [get_ports {west3_pin_in[8]}]
set_property PACKAGE_PIN H19 [get_ports {west3_pin_in[9]}]
set_property PACKAGE_PIN K19 [get_ports {west3_pin_in[10]}]
set_property PACKAGE_PIN G20 [get_ports {west3_pin_in[11]}]
set_property PACKAGE_PIN D21 [get_ports {west3_pin_in[12]}]
set_property PACKAGE_PIN J18 [get_ports {west3_pin_in[13]}]
set_property PACKAGE_PIN H17 [get_ports {west3_pin_in[14]}]
set_property PACKAGE_PIN J17 [get_ports {west3_pin_in[15]}]
set_property PACKAGE_PIN L18 [get_ports {west3_pin_in[16]}]
set_property PACKAGE_PIN L17 [get_ports {west3_pin_in[17]}]
set_property PACKAGE_PIN F21 [get_ports {west3_pin_out[0]}]
set_property PACKAGE_PIN D22 [get_ports {west3_pin_out[1]}]
set_property PACKAGE_PIN C22 [get_ports {west3_pin_out[2]}]
set_property PACKAGE_PIN F20 [get_ports {west3_pin_out[3]}]
set_property PACKAGE_PIN E21 [get_ports {west3_pin_out[4]}]
set_property PACKAGE_PIN C20 [get_ports {west3_pin_out[5]}]
set_property PACKAGE_PIN E19 [get_ports {west3_pin_out[6]}]
set_property PACKAGE_PIN G18 [get_ports {west3_pin_out[7]}]
set_property PACKAGE_PIN A20 [get_ports {west3_pin_out[8]}]
set_property PACKAGE_PIN A21 [get_ports {west3_pin_out[9]}]
set_property PACKAGE_PIN A22 [get_ports {west3_pin_out[10]}]
set_property PACKAGE_PIN A18 [get_ports {west3_pin_out[11]}]
set_property PACKAGE_PIN B18 [get_ports {west3_pin_out[12]}]
set_property PACKAGE_PIN F18 [get_ports {west3_pin_out[13]}]
set_property PACKAGE_PIN B22 [get_ports {west3_pin_out[14]}]
set_property PACKAGE_PIN E20 [get_ports {west3_pin_out[15]}]
set_property PACKAGE_PIN G17 [get_ports {west3_pin_out[16]}]
set_property PACKAGE_PIN B19 [get_ports {west3_pin_out[17]}]
set_property PACKAGE_PIN A17 [get_ports {west4_pin_in[0]}]
set_property PACKAGE_PIN A16 [get_ports {west4_pin_in[1]}]
set_property PACKAGE_PIN B20 [get_ports {west4_pin_in[2]}]
set_property PACKAGE_PIN F17 [get_ports {west4_pin_in[3]}]
set_property PACKAGE_PIN D19 [get_ports {west4_pin_in[4]}]
set_property PACKAGE_PIN C19 [get_ports {west4_pin_in[5]}]
set_property PACKAGE_PIN D17 [get_ports {west4_pin_in[6]}]
set_property PACKAGE_PIN B17 [get_ports {west4_pin_in[7]}]
set_property PACKAGE_PIN C17 [get_ports {west4_pin_in[8]}]
set_property PACKAGE_PIN C16 [get_ports {west4_pin_in[9]}]
set_property PACKAGE_PIN D18 [get_ports {west4_pin_in[10]}]
set_property PACKAGE_PIN D16 [get_ports {west4_pin_in[11]}]
set_property PACKAGE_PIN L16 [get_ports {west4_pin_in[12]}]
set_property PACKAGE_PIN K16 [get_ports {west4_pin_in[13]}]
set_property PACKAGE_PIN L15 [get_ports {west4_pin_in[14]}]
set_property PACKAGE_PIN K15 [get_ports {west4_pin_in[15]}]
set_property PACKAGE_PIN L13 [get_ports {west4_pin_in[16]}]
set_property PACKAGE_PIN L12 [get_ports {west4_pin_in[17]}]
set_property PACKAGE_PIN G15 [get_ports {west4_pin_out[0]}]
set_property PACKAGE_PIN H16 [get_ports {west4_pin_out[1]}]
set_property PACKAGE_PIN J16 [get_ports {west4_pin_out[2]}]
set_property PACKAGE_PIN G14 [get_ports {west4_pin_out[3]}]
set_property PACKAGE_PIN H14 [get_ports {west4_pin_out[4]}]
set_property PACKAGE_PIN H15 [get_ports {west4_pin_out[5]}]
set_property PACKAGE_PIN G13 [get_ports {west4_pin_out[6]}]
set_property PACKAGE_PIN J13 [get_ports {west4_pin_out[7]}]
set_property PACKAGE_PIN J14 [get_ports {west4_pin_out[8]}]
set_property PACKAGE_PIN H11 [get_ports {west4_pin_out[9]}]
set_property PACKAGE_PIN J11 [get_ports {west4_pin_out[10]}]
set_property PACKAGE_PIN K11 [get_ports {west4_pin_out[11]}]
set_property PACKAGE_PIN H12 [get_ports {west4_pin_out[12]}]
set_property PACKAGE_PIN K14 [get_ports {west4_pin_out[13]}]
set_property PACKAGE_PIN L11 [get_ports {west4_pin_out[14]}]
set_property PACKAGE_PIN K13 [get_ports {west4_pin_out[15]}]
set_property PACKAGE_PIN J12 [get_ports {west4_pin_out[16]}]
set_property PACKAGE_PIN F13 [get_ports {west4_pin_out[17]}]
set_property PACKAGE_PIN A12 [get_ports {west5_pin_in[0]}]
set_property PACKAGE_PIN E14 [get_ports {west5_pin_in[1]}]
set_property PACKAGE_PIN D13 [get_ports {west5_pin_in[2]}]
set_property PACKAGE_PIN D14 [get_ports {west5_pin_in[3]}]
set_property PACKAGE_PIN E16 [get_ports {west5_pin_in[4]}]
set_property PACKAGE_PIN F15 [get_ports {west5_pin_in[5]}]
set_property PACKAGE_PIN C14 [get_ports {west5_pin_in[6]}]
set_property PACKAGE_PIN E15 [get_ports {west5_pin_in[7]}]
set_property PACKAGE_PIN B12 [get_ports {west5_pin_in[8]}]
set_property PACKAGE_PIN C11 [get_ports {west5_pin_in[9]}]
set_property PACKAGE_PIN C12 [get_ports {west5_pin_in[10]}]
set_property PACKAGE_PIN E13 [get_ports {west5_pin_in[11]}]
set_property PACKAGE_PIN D11 [get_ports {west5_pin_in[12]}]
set_property PACKAGE_PIN D12 [get_ports {west5_pin_in[13]}]
set_property PACKAGE_PIN F12 [get_ports {west5_pin_in[14]}]
set_property PACKAGE_PIN A11 [get_ports {west5_pin_in[15]}]
set_property PACKAGE_PIN F11 [get_ports {west5_pin_in[16]}]
set_property PACKAGE_PIN E11 [get_ports {west5_pin_in[17]}]
set_property PACKAGE_PIN C15 [get_ports {west5_pin_out[0]}]
set_property PACKAGE_PIN B15 [get_ports {west5_pin_out[1]}]
set_property PACKAGE_PIN B14 [get_ports {west5_pin_out[2]}]
set_property PACKAGE_PIN B13 [get_ports {west5_pin_out[3]}]
set_property PACKAGE_PIN A13 [get_ports {west5_pin_out[4]}]
set_property PACKAGE_PIN A15 [get_ports {west5_pin_out[5]}]
set_property PACKAGE_PIN V19 [get_ports {west5_pin_out[6]}]
set_property PACKAGE_PIN T21 [get_ports {west5_pin_out[7]}]
set_property PACKAGE_PIN R24 [get_ports {west5_pin_out[8]}]
set_property PACKAGE_PIN P27 [get_ports {west5_pin_out[9]}]
set_property PACKAGE_PIN R26 [get_ports {west5_pin_out[10]}]
set_property PACKAGE_PIN T20 [get_ports {west5_pin_out[11]}]
set_property PACKAGE_PIN U20 [get_ports {west5_pin_out[12]}]
set_property PACKAGE_PIN V20 [get_ports {west5_pin_out[13]}]
set_property PACKAGE_PIN P26 [get_ports {west5_pin_out[14]}]
set_property PACKAGE_PIN P29 [get_ports {west5_pin_out[15]}]
set_property PACKAGE_PIN R28 [get_ports {west5_pin_out[16]}]
set_property PACKAGE_PIN P28 [get_ports {west5_pin_out[17]}]

set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_in[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west0_pin_out[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_in[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west1_pin_out[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_in[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west2_pin_out[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_in[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west3_pin_out[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_in[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west4_pin_out[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_in[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {west5_pin_out[17]}]




#set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets west0_pin_out_IBUF[0]]
#set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets west1_pin_out_IBUF[0]]
#set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets west2_pin_out_IBUF[0]]
#set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets west3_pin_out_IBUF[0]]
#set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets west4_pin_out_IBUF[0]]
#set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets west5_pin_out_IBUF[0]]

set_property DCI_CASCADE {34} [get_iobanks 33]
set_property CFGBVS VCCO [current_design]
set_property CONFIG_VOLTAGE 3.3 [current_design]
set_property BITSTREAM.GENERAL.COMPRESS true [current_design]
set_property BITSTREAM.CONFIG.CONFIGRATE 50 [current_design]
set_property BITSTREAM.CONFIG.SPI_BUSWIDTH 4 [current_design]
set_property BITSTREAM.CONFIG.SPI_FALL_EDGE Yes [current_design]

set_false_path -from [get_pins pcie_system_i/xdma_0/inst/pcie_system_xdma_0_0_pcie2_to_pcie3_wrapper_i/pcie2_ip_i/inst/inst/user_lnk_up_int_reg/C]


#set_input_delay
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 2.0 [get_ports {west5_pin_out[1]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 3.0 [get_ports {west5_pin_out[1]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[2]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[2]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[3]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[3]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[4]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[4]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[5]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[5]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[6]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[6]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[7]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[7]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[8]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[8]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[9]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[9]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[10]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[10]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[11]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[11]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[12]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[12]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[13]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[13]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[14]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[14]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[15]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[15]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[16]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[16]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -min -add_delay 1.0 [get_ports {west5_pin_out[17]}]
set_input_delay -clock [get_clocks {chip_outclk5}] -max -add_delay 2.0 [get_ports {west5_pin_out[17]}]

set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 2.0 [get_ports {west4_pin_out[1]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 3.0 [get_ports {west4_pin_out[1]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[2]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[2]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[3]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[3]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[4]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[4]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[5]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[5]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[6]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[6]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[7]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[7]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[8]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[8]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[9]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[9]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[10]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[10]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[11]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[11]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[12]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[12]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[13]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[13]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[14]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[14]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[15]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[15]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[16]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[16]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -min -add_delay 1.0 [get_ports {west4_pin_out[17]}]
set_input_delay -clock [get_clocks {chip_outclk4}] -max -add_delay 2.0 [get_ports {west4_pin_out[17]}]

set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 2.0 [get_ports {west3_pin_out[1]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 3.0 [get_ports {west3_pin_out[1]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[2]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[2]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[3]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[3]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[4]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[4]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[5]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[5]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[6]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[6]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[7]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[7]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[8]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[8]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[9]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[9]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[10]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[10]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[11]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[11]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[12]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[12]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[13]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[13]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[14]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[14]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[15]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[15]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[16]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[16]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -min -add_delay 1.0 [get_ports {west3_pin_out[17]}]
set_input_delay -clock [get_clocks {chip_outclk3}] -max -add_delay 2.0 [get_ports {west3_pin_out[17]}]

set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 2.0 [get_ports {west2_pin_out[1]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 3.0 [get_ports {west2_pin_out[1]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[2]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[2]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[3]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[3]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[4]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[4]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[5]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[5]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[6]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[6]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[7]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[7]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[8]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[8]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[9]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[9]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[10]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[10]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[11]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[11]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[12]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[12]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[13]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[13]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[14]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[14]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[15]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[15]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[16]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[16]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -min -add_delay 1.0 [get_ports {west2_pin_out[17]}]
set_input_delay -clock [get_clocks {chip_outclk2}] -max -add_delay 2.0 [get_ports {west2_pin_out[17]}]

set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 2.0 [get_ports {west1_pin_out[1]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 4.0 [get_ports {west1_pin_out[1]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[2]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[2]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[3]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[3]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[4]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[4]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[5]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[5]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[6]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[6]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[7]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[7]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[8]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[8]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[9]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[9]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[10]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[10]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[11]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[11]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[12]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[12]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[13]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[13]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[14]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[14]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[15]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[15]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[16]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[16]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -min -add_delay 1.0 [get_ports {west1_pin_out[17]}]
set_input_delay -clock [get_clocks {chip_outclk1}] -max -add_delay 2.0 [get_ports {west1_pin_out[17]}]


set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 2.0 [get_ports {west0_pin_out[1]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 3.0 [get_ports {west0_pin_out[1]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[2]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[2]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[3]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[3]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[4]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[4]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[5]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[5]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[6]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[6]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[7]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[7]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[8]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[8]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[9]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[9]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[10]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[10]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[11]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[11]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[12]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[12]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[13]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[13]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[14]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[14]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[15]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[15]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[16]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[16]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -min -add_delay 1.0 [get_ports {west0_pin_out[17]}]
set_input_delay -clock [get_clocks {chip_outclk0}] -max -add_delay 2.0 [get_ports {west0_pin_out[17]}]

set_property C_CLK_INPUT_FREQ_HZ 300000000 [get_debug_cores dbg_hub]
set_property C_ENABLE_CLK_DIVIDER false [get_debug_cores dbg_hub]
set_property C_USER_SCAN_CHAIN 1 [get_debug_cores dbg_hub]
connect_debug_port dbg_hub/clk [get_nets gdma_clk]
